# Intro to Pandas
by Ryan Orsinger

## Module 5: Combining Dataframes
- Using `.concat` to combine dataframes horizontally or vertically 
- Joining dataframes
- Understanding types of joins
- Using `.merge` to join dataframes together based on column values in common

In [1]:
import pandas as pd

In [2]:
# String concatenation
"con" + "cat" + "e" + "nation"

'concatenation'

In [3]:
# List concatenation
["con", "cat"] + ["e", "nation"]

['con', 'cat', 'e', 'nation']

In [4]:
# Dataframe Concatenation 
fruits = pd.DataFrame({
    "name": ["mango", "guava", "orange"],
    "quantity": [2, 1, 3]
})

vegetables = pd.DataFrame({
    "name": ["Brussels sprouts", "spinach", "broccoli"],
    "quantity": [1, 7, 4]
})

In [5]:
# Default arguments preserve the original index for each dataframe
pd.concat([fruits, vegetables])

               name  quantity
0             mango         2
1             guava         1
2            orange         3
0  Brussels sprouts         1
1           spinach         7
2          broccoli         4

In [6]:
# Axis=0 is the default argument for concatenating dataframes
pd.concat([fruits, vegetables], axis=0)

               name  quantity
0             mango         2
1             guava         1
2            orange         3
0  Brussels sprouts         1
1           spinach         7
2          broccoli         4

In [7]:
pd.concat([fruits, vegetables], ignore_index=True)

               name  quantity
0             mango         2
1             guava         1
2            orange         3
3  Brussels sprouts         1
4           spinach         7
5          broccoli         4

In [8]:
# Dataframe Concatenation 
fruits = pd.DataFrame({
    "name": ["mango", "guava", "orange"],
})

# Notice that this instance of vegetables lacks a quantity column
vegetables = pd.DataFrame({
    "name": ["Brussels sprouts", "spinach", "broccoli"],
    "quantity": [2, 3, 4]

})

# If a column is missing from a dataframe, its values will be missing, so the concatenation succeeds
pd.concat([fruits, vegetables])

               name  quantity
0             mango       NaN
1             guava       NaN
2            orange       NaN
0  Brussels sprouts       2.0
1           spinach       3.0
2          broccoli       4.0

In [9]:
# Axis=1 concatenates dataframes horizontally
price_quality = pd.DataFrame({
    "price": [2.99, 1.99, 3.99],
    "presentation": ["frozen", "washed", "raw, bunch"] 
})

pd.concat([vegetables, price_quality], axis=1)

               name  quantity  price presentation
0  Brussels sprouts         2   2.99       frozen
1           spinach         3   1.99       washed
2          broccoli         4   3.99   raw, bunch

In [10]:
# A common use-case for concatenating dataframes
# Reading multiple CSV files into a single dataframe

all_dfs = []

files = ["2020_sales.csv", "2021_sales.csv", "2022_sales.csv"]

for file in files:
    df = pd.read_csv(file)
    all_dfs.append(df)

sales = pd.concat(all_dfs, ignore_index=True)
sales

   year             items  units
0  2020            trucks     20
1  2020            sedans     15
2  2020  compact vehicles     14
3  2021            trucks     35
4  2021            sedans     30
5  2021  compact vehicles     17
6  2022            trucks     40
7  2022            sedans     31
8  2022  compact vehicles     35

## Using `.merge` to combine dataframes on common column values
- Database style join for Pandas Dataframes
- Pandas `.join` joins dataframes on identical column names that exist on both dataframes
- Using `.merge` can be more flexible, since sometimes the column names are not identical

## Types of Joins
- "Inner" returns records that have matching values in both tables.
- "Left" returns all records from the left table, and the matched records from the right table.
- "Right" returns all records from the right table, and the matched records from the left table.
- "Outer" Returns all records when there is a match in either left or right table.
![diagram of different types of joins](types_of_joins.png)

In [11]:
# Notice how role_id points to the id on the roles dataframe
# Take note of the missing data
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, None, None]
})

In [12]:
# Notice that the role id column is called "id" on the roles dataframe
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'role': ['admin', 'author', 'reviewer', 'commenter']
})

In [13]:
# An inner join returns members that exist on both the dataframes
users.merge(roles, left_on='role_id', right_on='id', how='inner')

   id_x   name  role_id  id_y      role
0     1    bob      1.0     1     admin
1     2    joe      2.0     2    author
2     3  sally      3.0     3  reviewer
3     4   adam      3.0     3  reviewer

In [14]:
# Notice that the left join keeps all records from the users dataframe, even if they are missing on the right dataframe
users.merge(roles, left_on='role_id', right_on='id', how='left')

   id_x   name  role_id  id_y      role
0     1    bob      1.0   1.0     admin
1     2    joe      2.0   2.0    author
2     3  sally      3.0   3.0  reviewer
3     4   adam      3.0   3.0  reviewer
4     5   jane      NaN   NaN       NaN
5     6   mike      NaN   NaN       NaN

In [15]:
# Notice that the right join keeps all records from the users dataframe, even if they are missing on the right dataframe
users.merge(roles, left_on='role_id', right_on='id', how='right')

   id_x   name  role_id  id_y       role
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [16]:
# The outer join keeps all records from every dataframe, but values are associated, where applicable
# Outer joins keep all values including nulls
users.merge(roles, left_on='role_id', right_on='id', how='outer')

   id_x   name  role_id  id_y       role
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

## Additional Resources
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html
- https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html
- https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html
- https://pandas.pydata.org/docs/user_guide/merging.html
- https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html#compare-with-sql-join

## Exercises